给定一个非负整数数组，a1, a2, ..., an, 和一个目标数，S。现在你有两个符号 + 和 -。对于数组中的任意一个整数，你都可以从 + 或 -中选择一个符号添加在前面。

返回可以使最终数组和为目标数 S 的所有添加符号的方法数。

示例 1:

输入: nums: [1, 1, 1, 1, 1], S: 3
输出: 5
解释: 

-1+1+1+1+1 = 3
+1-1+1+1+1 = 3
+1+1-1+1+1 = 3
+1+1+1-1+1 = 3
+1+1+1+1-1 = 3

一共有5种方法让最终目标和为3。

注意:
数组非空，且长度不会超过20。
初始的数组的和不会超过1000。
保证返回的最终结果能被32位整数存下

class Solution {
public:
    int findTargetSumWays(vector<int>& nums, int S) {
        int size=nums.size();
        //题目说了数组的初始和不会超过1000的-1000~1000  那不是2001个数吗
        vector<vector<int>> dp(size,vector<int>(2001));
        // 初始化
        dp[0][nums[0]+1000]=1;
        dp[0][-nums[0]+1000]+=1;
        for(int i=1;i<size;i++)
        for(int sum=-1000;sum<=1000;sum++)
        {   if(dp[i-1][sum+1000]>0)
           { dp[i][sum+nums[i]+1000]+=dp[i-1][sum+1000];
             dp[i][sum-nums[i]+1000]+=dp[i-1][sum+1000];    
           }
        }
        return S>1000?0:dp[size-1][S+1000];
    }
};
